; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	infrared3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	Star4 - direction
	Star2 - direction
	Star9 - direction
	GroundStation3 - direction
	Star8 - direction
	GroundStation5 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star7)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star8)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star9)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
)
(:goal (and
	(pointing satellite1 Star10)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star4 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star4)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 planet11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet11)
   goals met: 0 of 5
5. (take_image satellite1 planet11 instrument2 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon12 instrument2 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 5
8. (turn_to satellite1 star13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star13)
   goals met: 2 of 5
9. (take_image satellite1 star13 instrument2 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite1 star10 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star10)
   goals met: 4 of 5
11. (take_image satellite1 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 5
